requests/detach-volume.xml

<?xml version= "1.0" encoding= "UTF-8"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <CnsDetachVolume xmlns="urn:vsan">
            <_this type="CnsVolumeManager">cns-volume-manager</_this>
            <detachSpecs>
                <volumeId>
                    <id>{0}</id>
                </volumeId>
                <vm>{1}</vm>
            </detachSpecs>
        </CnsDetachVolume>
    </Body>
</Envelope>